<!DOCTYPE html><html lang="zh-CN"><head><meta name="generator" content="Hexo 3.9.0"><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="author" content="brokge"><title>大学 · 吾與爾</title><meta name="description" content="&amp;#x5927;&amp;#x5B66;&amp;#x4E4B;&amp;#x9053;&amp;#xFF0C;&amp;#x5728;&amp;#x660E;&amp;#x660E;&amp;#x5FB7;&amp;#xFF0C;&amp;#x5728;&amp;#x4EB2;&amp;#x6C11;&amp;#xFF0C;&amp;#x5728;&amp;#x6B62;&amp;#x4E8E;&amp;#x81F3;&amp;#x558"><meta name="keywords" content="吾与尔"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="renderer" content="webkit"><link rel="short icon" href="/images/favicon.png" type="image/x-icon"><link rel="stylesheet" href="/css/bootstrap.min.css"><link rel="stylesheet" href="/css/font-awesome.min.css"><link rel="stylesheet" href="/css/style-red.css"><link rel="alternate" type="application/atom+xml" title="ATOM 1.0" href="/atom.xml"><link rel="stylesheet" href="/css/prism-ghcolors.css" type="text/css">
<link rel="stylesheet" href="/css/prism-line-numbers.css" type="text/css"></head><body><div id="stage" class="container"><div class="row"><div id="side-bar" class="col-sm-3 col-xs-12 side-container invisible"><div class="vertical-text site-title"><h3 tabindex="-1" class="site-title-small"><a href="/" class="a-title">I and i</a></h3><h1 tabindex="-1" class="site-title-large"><a href="/" class="a-title">吾與爾</a></h1><!--h6(onclick="triggerSiteNav()") Trigger--></div><br class="visible-lg visible-md visible-sm"><div id="site-nav" class="site-title-links"><ul><li><a href="/">首頁</a></li><li><a href="/archives">歸檔</a></li><li><a href="/categories">分類</a></li><li><a href="/tags">標籤</a></li><li> <a href="https://brokge.github.io/scrapydoc/">爬虫</a></li><li> <a href="https://brokge.github.io/linux-command-line/html/">Linux命令行</a></li><li><a href="/about/index.html">关于</a></li><li class="soc"><a href="https://github.com/brokge" target="_blank" rel="noopener noreferrer"><i class="fa fa-github">&nbsp;</i></a><a href="https://brokge.github.io/atom.xml" target="_blank" rel="noopener noreferrer"><i class="fa fa-rss">&nbsp;</i></a></li></ul><div class="visible-lg visible-md visible-sm site-nav-footer"><br class="site-nav-footer-br"><footer><p>&copy;&nbsp;2019&nbsp;<a target="_blank" href="https://brokge.github.io" rel="noopener noreferrer">brokge</a></p><p>Theme&nbsp;<a target="_blank" href="https://github.com/SumiMakito/hexo-theme-typography" rel="noopener noreferrer">Typography</a>&nbsp;by&nbsp;<a target="_blank" href="https://www.keep.moe" rel="noopener noreferrer">Makito</a></p><p>Proudly published with&nbsp;<a target="_blank" href="https://hexo.io" rel="noopener noreferrer">Hexo</a></p></footer><script type="text/javascript" id="maid-script" src="https://unpkg.com/mermaid@7.1.2/dist/mermaid.min.js?v=undefined"></script><script>if (window.mermaid) {
  var options = JSON.parse(document.getElementById('maid-script').getAttribute('mermaidoptioins'));
  mermaid.initialize(options);
}
 </script></div></div></div><div id="main-container" class="col-sm-9 col-xs-12 main-container invisible"><div class="autopagerize_page_element"><div class="content"><div class="post-page"><div class="post-container"><p class="post-title"><a>大学</a></p><p class="post-meta"><span class="date meta-item">發佈於&nbsp;2018-11-01</span></p><p class="post-abstract"></p><p>&#x5927;&#x5B66;&#x4E4B;&#x9053;&#xFF0C;&#x5728;&#x660E;&#x660E;&#x5FB7;&#xFF0C;&#x5728;&#x4EB2;&#x6C11;&#xFF0C;&#x5728;&#x6B62;&#x4E8E;&#x81F3;&#x5584;&#x3002;&#x77E5;&#x6B62;&#x800C;&#x540E;&#x6709;&#x5B9A;&#xFF0C;&#x5B9A;&#x800C;&#x540E;&#x80FD;&#x9759;&#xFF0C;&#x9759;&#x800C;&#x540E;&#x80FD;&#x5B89;&#xFF0C;&#x5B89;&#x800C;&#x540E;&#x80FD;&#x8651;&#xFF0C;&#x8651;&#x800C;&#x540E;&#x80FD;&#x5F97;&#x3002;&#x7269;&#x6709;&#x672C;&#x672B;&#xFF0C;&#x4E8B;&#x6709;&#x7EC8;&#x59CB;&#xFF0C;&#x77E5;&#x6240;&#x5148;&#x540E;&#xFF0C;&#x5219;&#x8FD1;&#x9053;&#x77E3;&#x3002;&#x53E4;&#x4E4B;&#x6B32;&#x660E;&#x660E;&#x5FB7;&#x4E8E;&#x5929;&#x4E0B;&#x8005;&#xFF0C;&#x5148;&#x6CBB;&#x5176;&#x56FD;&#xFF1B;&#x6B32;&#x6CBB;&#x5176;&#x56FD;&#x8005;&#xFF0C;&#x5148;&#x9F50;&#x5176;&#x5BB6;&#xFF1B;&#x6B32;&#x9F50;&#x5176;&#x5BB6;&#x8005;&#xFF0C;&#x5148;&#x8129;&#x5176;&#x8EAB;&#xFF1B;&#x6B32;&#x8129;&#x5176;&#x8EAB;&#x8005;&#xFF0C;&#x5148;&#x6B63;&#x5176;&#x5FC3;&#xFF1B;&#x6B32;&#x6B63;&#x5176;&#x5FC3;&#x8005;&#xFF0C;&#x5148;&#x8BDA;&#x5176;&#x610F;&#xFF1B;&#x6B32;&#x8BDA;&#x5176;&#x610F;&#x8005;&#xFF0C;&#x5148;&#x81F4;&#x5176;&#x77E5;&#xFF0C;&#x81F4;&#x77E5;&#x5728;&#x683C;&#x7269;&#x3002;&#x7269;&#x683C;&#x800C;&#x540E;&#x77E5;&#x81F3;&#xFF0C;&#x77E5;&#x81F3;&#x800C;&#x540E;&#x610F;&#x8BDA;&#xFF0C;&#x610F;&#x8BDA;&#x800C;&#x540E;&#x5FC3;&#x6B63;&#xFF0C;&#x5FC3;&#x6B63;&#x800C;&#x540E;&#x8EAB;&#x8129;&#xFF0C;&#x8EAB;&#x8129;&#x800C;&#x540E;&#x5BB6;&#x9F50;&#xFF0C;&#x5BB6;&#x9F50;&#x800C;&#x540E;&#x56FD;&#x6CBB;&#xFF0C;&#x56FD;&#x6CBB;&#x800C;&#x540E;&#x5929;&#x4E0B;&#x5E73;&#x3002;&#x81EA;&#x5929;&#x5B50;&#x4EE5;&#x81F3;&#x4E8E;&#x5EB6;&#x4EBA;&#xFF0C;&#x58F9;&#x662F;&#x7686;&#x4EE5;&#x8129;&#x8EAB;&#x4E3A;&#x672C;&#x3002;&#x5176;&#x672C;&#x4E71;&#x800C;&#x672B;&#x6CBB;&#x8005;&#x5426;&#x77E3;&#xFF0C;&#x5176;&#x6240;&#x539A;&#x8005;&#x8584;&#xFF0C;&#x800C;&#x5176;&#x6240;&#x8584;&#x8005;&#x539A;&#xFF0C;&#x672A;&#x4E4B;&#x6709;&#x4E5F;&#xFF01;&#x6B64;&#x8C13;&#x77E5;&#x672C;&#xFF0C;&#x6B64;&#x8C13;&#x77E5;&#x4E4B;&#x81F3;&#x4E5F;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x8BDA;&#x5176;&#x610F;&#x8005;&#xFF0C;&#x6BCB;&#x81EA;&#x6B3A;&#x4E5F;&#xFF0C;&#x5982;&#x6076;&#x6076;&#x81ED;&#xFF0C;&#x5982;&#x597D;&#x597D;&#x8272;&#xFF0C;&#x6B64;&#x4E4B;&#x8C13;&#x81EA;&#x8C26;&#xFF0C;&#x6545;&#x541B;&#x5B50;&#x5FC5;&#x614E;&#x5176;&#x72EC;&#x4E5F;&#xFF01;&#x5C0F;&#x4EBA;&#x95F2;&#x5C45;&#x4E3A;&#x4E0D;&#x5584;&#xFF0C;&#x65E0;&#x6240;&#x4E0D;&#x81F3;&#xFF0C;&#x89C1;&#x541B;&#x5B50;&#x800C;&#x540E;&#x538C;&#x7136;&#xFF0C;&#x63DC;&#x5176;&#x4E0D;&#x5584;&#xFF0C;&#x800C;&#x8457;&#x5176;&#x5584;&#x3002;&#x4EBA;&#x4E4B;&#x89C6;&#x5DF1;&#xFF0C;&#x5982;&#x89C1;&#x5176;&#x80BA;&#x809D;&#x7136;&#xFF0C;&#x5219;&#x4F55;&#x76CA;&#x77E3;&#xFF01;&#x6B64;&#x8C13;&#x8BDA;&#x4E8E;&#x4E2D;&#xFF0C;&#x5F62;&#x4E8E;&#x5916;&#xFF0C;&#x6545;&#x541B;&#x5B50;&#x5FC5;&#x614E;&#x5176;&#x72EC;&#x4E5F;&#x3002;&#x66FE;&#x5B50;&#x66F0;&#xFF1A;&#x300C;&#x5341;&#x76EE;&#x6240;&#x89C6;&#xFF0C;&#x5341;&#x624B;&#x6240;&#x6307;&#xFF0C;&#x5176;&#x4E25;&#x4E4E;&#xFF01;&#x300D;&#x5BCC;&#x6DA6;&#x5C4B;&#xFF0C;&#x5FB7;&#x6DA6;&#x8EAB;&#xFF0C;&#x5FC3;&#x5E7F;&#x4F53;&#x80D6;&#xFF0C;&#x6545;&#x541B;&#x5B50;&#x5FC5;&#x8BDA;&#x5176;&#x610F;&#x3002;</p>
<p>&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x77BB;&#x5F7C;&#x6DC7;&#x6FB3;&#xFF0C;&#x83C9;&#x7AF9;&#x7317;&#x7317;&#x3002;&#x6709;&#x6590;&#x541B;&#x5B50;&#xFF0C;&#x5982;&#x5207;&#x5982;&#x78CB;&#xFF0C;&#x5982;&#x7422;&#x5982;&#x78E8;&#x3002;&#x745F;&#x516E;&#x50E9;&#x516E;&#xFF0C;&#x8D6B;&#x516E;&#x55A7;&#x516E;&#x3002;&#x6709;&#x6590;&#x541B;&#x5B50;&#xFF0C;&#x7EC8;&#x4E0D;&#x53EF;&#x55A7;&#x516E;&#xFF01;&#x300D;&#x300C;&#x5982;&#x5207;&#x5982;&#x78CB;&#x300D;&#x8005;&#xFF0C;&#x9053;&#x5B66;&#x4E5F;&#xFF1B;&#x300C;&#x5982;&#x7422;&#x5982;&#x78E8;&#x300D;&#x8005;&#xFF0C;&#x81EA;&#x8129;&#x4E5F;&#xFF1B;&#x300C;&#x745F;&#x516E;&#x50E9;&#x516E;&#x300D;&#x8005;&#xFF0C;&#x6042;&#x6144;&#x4E5F;&#xFF1B;&#x300C;&#x8D6B;&#x516E;&#x55A7;&#x516E;&#x300D;&#x8005;&#xFF0C;&#x5A01;&#x4EEA;&#x4E5F;&#xFF1B;&#x300C;&#x6709;&#x6590;&#x541B;&#x5B50;&#xFF0C;&#x7EC8;&#x4E0D;&#x53EF;&#x55A7;&#x516E;&#x300D;&#x8005;&#xFF0C;&#x9053;&#x76DB;&#x5FB7;&#x81F3;&#x5584;&#xFF0C;&#x6C11;&#x4E4B;&#x4E0D;&#x80FD;&#x5FD8;&#x4E5F;&#x3002;&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x65BC;&#x620F;&#xFF0C;&#x524D;&#x738B;&#x4E0D;&#x5FD8;&#xFF01;&#x300D;&#x541B;&#x5B50;&#x8D24;&#x5176;&#x8D24;&#x800C;&#x4EB2;&#x5176;&#x4EB2;&#xFF0C;&#x5C0F;&#x4EBA;&#x4E50;&#x5176;&#x4E50;&#x800C;&#x5229;&#x5176;&#x5229;&#xFF0C;&#x6B64;&#x4EE5;&#x6CA1;&#x4E16;&#x4E0D;&#x5FD8;&#x4E5F;&#x3002;</p>
<p>&#x300A;&#x5EB7;&#x8BF0;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x514B;&#x660E;&#x5FB7;&#x3002;&#x300D;&#x300A;&#x592A;&#x7532;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x987E;&#x8ADF;&#x5929;&#x4E4B;&#x660E;&#x547D;&#x3002;&#x300D;&#x300A;&#x5E1D;&#x5178;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x514B;&#x660E;&#x5CFB;&#x5FB7;&#x3002;&#x300D;&#x7686;&#x81EA;&#x660E;&#x4E5F;&#x3002;</p>
<p>&#x6C64;&#x4E4B;&#x300A;&#x76D8;&#x94ED;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x830D;&#x65E5;&#x65B0;&#xFF0C;&#x65E5;&#x65E5;&#x65B0;&#xFF0C;&#x53C8;&#x65E5;&#x65B0;&#x3002;&#x300D;&#x300A;&#x5EB7;&#x8BF0;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x4F5C;&#x65B0;&#x6C11;&#x3002;&#x300D;&#x300A;&#x8BD7;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x5468;&#x867D;&#x65E7;&#x90A6;&#xFF0C;&#x5176;&#x547D;&#x7EF4;&#x65B0;&#x3002;&#x300D;&#x662F;&#x6545;&#x541B;&#x5B50;&#x65E0;&#x6240;&#x4E0D;&#x7528;&#x5176;&#x6781;&#x3002;<br>&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x90A6;&#x757F;&#x5343;&#x91CC;&#xFF0C;&#x7EF4;&#x6C11;&#x6240;&#x6B62;&#x3002;&#x300D;&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x7F17;&#x86EE;&#x9EC4;&#x9E1F;&#xFF0C;&#x6B62;&#x4E8E;&#x4E18;&#x9685;&#x3002;&#x300D;&#x5B50;&#x66F0;&#xFF1A;&#x300C;&#x65BC;&#x6B62;&#xFF0C;&#x77E5;&#x5176;&#x6240;&#x6B62;&#xFF0C;&#x53EF;&#x4EE5;&#x4EBA;&#x800C;&#x4E0D;&#x5982;&#x9E1F;&#x4E4E;&#xFF1F;&#x300D;&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x7A46;&#x7A46;&#x6587;&#x738B;&#xFF0C;&#x65BC;&#x7F09;&#x7199;&#x656C;&#x6B62;&#xFF01;&#x300D;&#x4E3A;&#x4EBA;&#x541B;&#xFF0C;&#x6B62;&#x4E8E;&#x4EC1;&#xFF1B;&#x4E3A;&#x4EBA;&#x81E3;&#x6B62;&#x4E8E;&#x656C;&#xFF1B;&#x4E3A;&#x4EBA;&#x5B50;&#xFF0C;&#x6B62;&#x4E8E;&#x5B5D;&#xFF1B;&#x4E3A;&#x4EBA;&#x7236;&#xFF0C;&#x6B62;&#x4E8E;&#x6148;&#xFF1B;&#x4E0E;&#x56FD;&#x4EBA;&#x4EA4;&#xFF0C;&#x6B62;&#x4E8E;&#x4FE1;&#x3002;</p>
<p>&#x5B50;&#x66F0;&#xFF1A;&#x300C;&#x542C;&#x8BBC;&#xFF0C;&#x543E;&#x72B9;&#x4EBA;&#x4E5F;&#xFF0C;&#x5FC5;&#x4E5F;&#x4F7F;&#x65E0;&#x8BBC;&#x4E4E;&#xFF01;&#x300D;&#x65E0;&#x60C5;&#x8005;&#x4E0D;&#x5F97;&#x5C3D;&#x5176;&#x8F9E;&#xFF0C;&#x5927;&#x754F;&#x6C11;&#x5FD7;&#x3002;&#x6B64;&#x8C13;&#x77E5;&#x672C;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x8129;&#x8EAB;&#x5728;&#x6B63;&#x5176;&#x5FC3;&#x8005;&#xFF0C;&#x8EAB;&#x6709;&#x6240;&#x5FFF;&#x61E5;&#xFF0C;&#x5219;&#x4E0D;&#x5F97;&#x5176;&#x6B63;&#xFF1B;&#x6709;&#x6240;&#x6050;&#x60E7;&#xFF0C;&#x5219;&#x4E0D;&#x5F97;&#x5176;&#x6B63;&#xFF1B;&#x6709;&#x6240;&#x597D;&#x4E50;&#xFF0C;&#x5219;&#x4E0D;&#x5F97;&#x5176;&#x6B63;&#xFF1B;&#x6709;&#x6240;&#x5FE7;&#x60A3;&#xFF0C;&#x5219;&#x4E0D;&#x5F97;&#x5176;&#x6B63;&#x3002;&#x5FC3;&#x4E0D;&#x5728;&#x7109;&#xFF0C;&#x89C6;&#x800C;&#x4E0D;&#x89C1;&#xFF0C;&#x542C;&#x800C;&#x4E0D;&#x95FB;&#xFF0C;&#x98DF;&#x800C;&#x4E0D;&#x77E5;&#x5176;&#x5473;&#x3002;&#x6B64;&#x8C13;&#x8129;&#x8EAB;&#x5728;&#x6B63;&#x5176;&#x5FC3;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x9F50;&#x5176;&#x5BB6;&#x5728;&#x8129;&#x5176;&#x8EAB;&#x8005;&#xFF0C;&#x4EBA;&#x4E4B;&#x5176;&#x6240;&#x4EB2;&#x7231;&#x800C;&#x8F9F;&#x7109;&#xFF0C;&#x4E4B;&#x5176;&#x6240;&#x8D31;&#x6076;&#x800C;&#x8F9F;&#x7109;&#xFF0C;&#x4E4B;&#x5176;&#x6240;&#x754F;&#x656C;&#x800C;&#x8F9F;&#x7109;&#xFF0C;&#x4E4B;&#x5176;&#x6240;&#x54C0;&#x77DC;&#x800C;&#x8F9F;&#x7109;&#xFF0C;&#x4E4B;&#x5176;&#x6240;&#x6556;&#x60F0;&#x800C;&#x8F9F;&#x7109;&#x3002;&#x6545;&#x597D;&#x800C;&#x77E5;&#x5176;&#x6076;&#xFF0C;&#x6076;&#x800C;&#x77E5;&#x5176;&#x7F8E;&#x8005;&#xFF0C;&#x5929;&#x4E0B;&#x9C9C;&#x77E3;&#xFF01;&#x6545;&#x8C1A;&#x6709;&#x4E4B;&#x66F0;&#xFF1A;&#x300C;&#x4EBA;&#x83AB;&#x77E5;&#x5176;&#x5B50;&#x4E4B;&#x6076;&#xFF0C;&#x83AB;&#x77E5;&#x5176;&#x82D7;&#x4E4B;&#x7855;&#x3002;&#x300D;&#x6B64;&#x8C13;&#x8EAB;&#x4E0D;&#x8129;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x9F50;&#x5176;&#x5BB6;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x6CBB;&#x56FD;&#x5FC5;&#x5148;&#x9F50;&#x5176;&#x5BB6;&#x8005;&#xFF0C;&#x5176;&#x5BB6;&#x4E0D;&#x53EF;&#x6559;&#x800C;&#x80FD;&#x6559;&#x4EBA;&#x8005;&#xFF0C;&#x65E0;&#x4E4B;&#x3002;&#x6545;&#x541B;&#x5B50;&#x4E0D;&#x51FA;&#x5BB6;&#x800C;&#x6210;&#x6559;&#x4E8E;&#x56FD;&#xFF1A;&#x5B5D;&#x8005;&#xFF0C;&#x6240;&#x4EE5;&#x4E8B;&#x541B;&#x4E5F;&#xFF1B;&#x5F1F;&#x8005;&#xFF0C;&#x6240;&#x4EE5;&#x4E8B;&#x957F;&#x4E5F;&#xFF1B;&#x6148;&#x8005;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x4F17;&#x4E5F;&#x3002;&#x300A;&#x5EB7;&#x8BF0;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x5982;&#x4FDD;&#x8D64;&#x5B50;&#x300D;&#xFF0C;&#x5FC3;&#x8BDA;&#x6C42;&#x4E4B;&#xFF0C;&#x867D;&#x4E0D;&#x4E2D;&#xFF0C;&#x4E0D;&#x8FDC;&#x77E3;&#x3002;&#x672A;&#x6709;&#x5B66;&#x517B;&#x5B50;&#x800C;&#x540E;&#x5AC1;&#x8005;&#x4E5F;&#xFF01;&#x4E00;&#x5BB6;&#x4EC1;&#xFF0C;&#x4E00;&#x56FD;&#x5174;&#x4EC1;&#xFF1B;&#x4E00;&#x5BB6;&#x8BA9;&#xFF0C;&#x4E00;&#x56FD;&#x5174;&#x8BA9;&#xFF1B;&#x4E00;&#x4EBA;&#x8D2A;&#x623E;&#xFF0C;&#x4E00;&#x56FD;&#x4F5C;&#x4E71;&#x3002;&#x5176;&#x673A;&#x5982;&#x6B64;&#x3002;&#x6B64;&#x8C13;&#x4E00;&#x8A00;&#x507E;&#x4E8B;&#xFF0C;&#x4E00;&#x4EBA;&#x5B9A;&#x56FD;&#x3002;&#x5C27;&#x3001;&#x821C;&#x7387;&#x5929;&#x4E0B;&#x4EE5;&#x4EC1;&#xFF0C;&#x800C;&#x6C11;&#x4ECE;&#x4E4B;&#xFF1B;&#x6840;&#x3001;&#x7EA3;&#x7387;&#x5929;&#x4E0B;&#x4EE5;&#x66B4;&#xFF0C;&#x800C;&#x6C11;&#x4ECE;&#x4E4B;&#x3002;&#x5176;&#x6240;&#x4EE4;&#x53CD;&#x5176;&#x6240;&#x597D;&#xFF0C;&#x800C;&#x6C11;&#x4E0D;&#x4ECE;&#x3002;&#x662F;&#x6545;&#x541B;&#x5B50;&#x6709;&#x8BF8;&#x5DF1;&#x800C;&#x540E;&#x6C42;&#x8BF8;&#x4EBA;&#xFF0C;&#x65E0;&#x8BF8;&#x5DF1;&#x800C;&#x540E;&#x975E;&#x8BF8;&#x4EBA;&#x3002;&#x6240;&#x85CF;&#x4E4E;&#x8EAB;&#x4E0D;&#x6055;&#xFF0C;&#x800C;&#x80FD;&#x55BB;&#x8BF8;&#x4EBA;&#x8005;&#xFF0C;&#x672A;&#x4E4B;&#x6709;&#x4E5F;&#x3002;&#x6545;&#x6CBB;&#x56FD;&#x5728;&#x9F50;&#x5176;&#x5BB6;&#x3002;&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x6843;&#x4E4B;&#x592D;&#x592D;&#xFF0C;&#x5176;&#x53F6;&#x84C1;&#x84C1;&#xFF1B;&#x4E4B;&#x5B50;&#x4E8E;&#x5F52;&#xFF0C;&#x5B9C;&#x5176;&#x5BB6;&#x4EBA;&#x3002;&#x300D;&#x5B9C;&#x5176;&#x5BB6;&#x4EBA;&#xFF0C;&#x800C;&#x540E;&#x53EF;&#x4EE5;&#x6559;&#x56FD;&#x4EBA;&#x3002;&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x5B9C;&#x5144;&#x5B9C;&#x5F1F;&#x3002;&#x300D;&#x5B9C;&#x5144;&#x5B9C;&#x5F1F;&#xFF0C;&#x800C;&#x540E;&#x53EF;&#x4EE5;&#x6559;&#x56FD;&#x4EBA;&#x3002;&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x5176;&#x4EEA;&#x4E0D;&#x5FD2;&#xFF0C;&#x6B63;&#x662F;&#x56DB;&#x56FD;&#x3002;&#x300D;&#x5176;&#x4E3A;&#x7236;&#x5B50;&#x5144;&#x5F1F;&#x8DB3;&#x6CD5;&#xFF0C;&#x800C;&#x540E;&#x6C11;&#x6CD5;&#x4E4B;&#x4E5F;&#x3002;&#x6B64;&#x8C13;&#x6CBB;&#x56FD;&#x5728;&#x9F50;&#x5176;&#x5BB6;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x5E73;&#x5929;&#x4E0B;&#x5728;&#x6CBB;&#x5176;&#x56FD;&#x8005;&#xFF0C;&#x4E0A;&#x8001;&#x8001;&#x800C;&#x6C11;&#x5174;&#x5B5D;&#xFF0C;&#x4E0A;&#x957F;&#x957F;&#x800C;&#x6C11;&#x5174;&#x5F1F;&#xFF0C;&#x4E0A;&#x6064;&#x5B64;&#x800C;&#x6C11;&#x4E0D;&#x500D;&#xFF0C;&#x662F;&#x4EE5;&#x541B;&#x5B50;&#x6709;&#x7D5C;&#x77E9;&#x4E4B;&#x9053;&#x4E5F;&#x3002;&#x6240;&#x6076;&#x4E8E;&#x4E0A;&#xFF0C;&#x6BCB;&#x4EE5;&#x4F7F;&#x4E0B;&#xFF1B;&#x6240;&#x6076;&#x4E8E;&#x4E0B;&#xFF0C;&#x6BCB;&#x4EE5;&#x4E8B;&#x4E0A;&#xFF1B;&#x6240;&#x6076;&#x4E8E;&#x524D;&#xFF0C;&#x6BCB;&#x4EE5;&#x5148;&#x540E;&#xFF1B;&#x6240;&#x6076;&#x4E8E;&#x540E;&#xFF0C;&#x6BCB;&#x4EE5;&#x4ECE;&#x524D;&#xFF1B;&#x6240;&#x6076;&#x4E8E;&#x53F3;&#xFF0C;&#x6BCB;&#x4EE5;&#x4EA4;&#x4E8E;&#x5DE6;&#xFF1B;&#x6240;&#x6076;&#x4E8E;&#x5DE6;&#xFF0C;&#x6BCB;&#x4EE5;&#x4EA4;&#x4E8E;&#x53F3;&#x3002;&#x6B64;&#x4E4B;&#x8C13;&#x7D5C;&#x77E9;&#x4E4B;&#x9053;&#x3002;</p>
<p>&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x4E50;&#x53EA;&#x541B;&#x5B50;&#xFF0C;&#x6C11;&#x4E4B;&#x7236;&#x6BCD;&#x3002;&#x300D;&#x6C11;&#x4E4B;&#x6240;&#x597D;&#x597D;&#x4E4B;&#xFF0C;&#x6C11;&#x4E4B;&#x6240;&#x6076;&#x6076;&#x4E4B;&#xFF0C;&#x6B64;&#x4E4B;&#x8C13;&#x6C11;&#x4E4B;&#x7236;&#x6BCD;&#x3002;&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x8282;&#x5F7C;&#x5357;&#x5C71;&#xFF0C;&#x7EF4;&#x77F3;&#x5CA9;&#x5CA9;&#x3002;&#x8D6B;&#x8D6B;&#x5E08;&#x5C39;&#xFF0C;&#x6C11;&#x5177;&#x5C14;&#x77BB;&#x3002;&#x300D;&#x6709;&#x56FD;&#x8005;&#x4E0D;&#x53EF;&#x4EE5;&#x4E0D;&#x614E;&#xFF0C;&#x8F9F;&#xFF0C;&#x5219;&#x4E3A;&#x5929;&#x4E0B;&#x622E;&#x77E3;&#x3002;&#x300A;&#x8BD7;&#x300B;&#x4E91;&#xFF1A;&#x300C;&#x6BB7;&#x4E4B;&#x672A;&#x4E27;&#x5E08;&#xFF0C;&#x514B;&#x914D;&#x4E0A;&#x5E1D;&#x3002;&#x4EEA;&#x76D1;&#x4E8E;&#x6BB7;&#xFF0C;&#x5CFB;&#x547D;&#x4E0D;&#x6613;&#x3002;&#x300D;&#x9053;&#x5F97;&#x4F17;&#x5219;&#x5F97;&#x56FD;&#xFF0C;&#x5931;&#x4F17;&#x5219;&#x5931;&#x56FD;&#x3002;&#x662F;&#x6545;&#x541B;&#x5B50;&#x5148;&#x614E;&#x4E4E;&#x5FB7;&#x3002;&#x6709;&#x5FB7;&#x6B64;&#x6709;&#x4EBA;&#xFF0C;&#x6709;&#x4EBA;&#x6B64;&#x6709;&#x571F;&#xFF0C;&#x6709;&#x571F;&#x6B64;&#x6709;&#x8D22;&#xFF0C;&#x6709;&#x8D22;&#x6B64;&#x6709;&#x7528;&#x3002;&#x5FB7;&#x8005;&#x672C;&#x4E5F;&#xFF0C;&#x8D22;&#x8005;&#x672B;&#x4E5F;&#x3002;&#x5916;&#x672C;&#x5185;&#x672B;&#xFF0C;&#x4E89;&#x6C11;&#x65BD;&#x593A;&#x3002;&#x662F;&#x6545;&#x8D22;&#x805A;&#x5219;&#x6C11;&#x6563;&#xFF0C;&#x8D22;&#x6563;&#x5219;&#x6C11;&#x805A;&#x3002;&#x662F;&#x6545;&#x8A00;&#x6096;&#x800C;&#x51FA;&#x8005;&#xFF0C;&#x4EA6;&#x6096;&#x800C;&#x5165;&#xFF1B;&#x8D27;&#x6096;&#x800C;&#x5165;&#x8005;&#xFF0C;&#x4EA6;&#x6096;&#x800C;&#x51FA;&#x3002;&#x300A;&#x5EB7;&#x8BF0;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x60DF;&#x547D;&#x4E0D;&#x4E8E;&#x5E38;&#xFF01;&#x300D;&#x9053;&#x5584;&#x5219;&#x5F97;&#x4E4B;&#xFF0C;&#x4E0D;&#x5584;&#x5219;&#x5931;&#x4E4B;&#x77E3;&#x3002;&#x300A;&#x695A;&#x4E66;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x695A;&#x56FD;&#x65E0;&#x4EE5;&#x4E3A;&#x5B9D;&#xFF0C;&#x60DF;&#x5584;&#x4EE5;&#x4E3A;&#x5B9D;&#x3002;&#x300D;&#x8205;&#x72AF;&#x66F0;&#xFF1A;&#x300C;&#x4EA1;&#x4EBA;&#x65E0;&#x4EE5;&#x4E3A;&#x5B9D;&#xFF0C;&#x4EC1;&#x4EB2;&#x4EE5;&#x4E3A;&#x5B9D;&#x3002;&#x300D;&#x300A;&#x79E6;&#x8A93;&#x300B;&#x66F0;&#xFF1A;&#x300C;&#x82E5;&#x6709;&#x4E00;&#x4ECB;&#x81E3;&#xFF0C;&#x65AD;&#x65AD;&#x516E;&#x65E0;&#x4ED6;&#x6280;&#xFF0C;&#x5176;&#x5FC3;&#x4F11;&#x4F11;&#x7109;&#xFF0C;&#x5176;&#x5982;&#x6709;&#x5BB9;&#x7109;&#x3002;&#x4EBA;&#x4E4B;&#x6709;&#x6280;&#xFF0C;&#x82E5;&#x5DF1;&#x6709;&#x4E4B;&#xFF1B;&#x4EBA;&#x4E4B;&#x5F66;&#x5723;&#xFF0C;&#x5176;&#x5FC3;&#x597D;&#x4E4B;&#xFF0C;&#x4E0D;&#x557B;&#x82E5;&#x81EA;&#x5176;&#x53E3;&#x51FA;&#x3002;&#x5B9E;&#x80FD;&#x5BB9;&#x4E4B;&#xFF0C;&#x4EE5;&#x80FD;&#x4FDD;&#x6211;&#x5B50;&#x5B59;&#x9ECE;&#x6C11;&#xFF0C;&#x5C1A;&#x4EA6;&#x6709;&#x5229;&#x54C9;&#xFF01;&#x4EBA;&#x4E4B;&#x6709;&#x6280;&#xFF0C;&#x5AA2;&#x5AC9;&#x4EE5;&#x6076;&#x4E4B;&#xFF1B;&#x4EBA;&#x4E4B;&#x5F66;&#x5723;&#xFF0C;&#x800C;&#x8FDD;&#x4E4B;&#x4FFE;&#x4E0D;&#x901A;&#x3002;&#x5B9E;&#x4E0D;&#x80FD;&#x5BB9;&#xFF0C;&#x4EE5;&#x4E0D;&#x80FD;&#x4FDD;&#x6211;&#x5B50;&#x5B59;&#x9ECE;&#x6C11;&#xFF0C;&#x4EA6;&#x66F0;&#x6B86;&#x54C9;&#xFF01;&#x300D;&#x552F;&#x4EC1;&#x4EBA;&#x653E;&#x6D41;&#x4E4B;&#xFF0C;&#x8FF8;&#x8BF8;&#x56DB;&#x5937;&#xFF0C;&#x4E0D;&#x4E0E;&#x540C;&#x4E2D;&#x56FD;&#xFF0C;&#x6B64;&#x8C13;&#x552F;&#x4EC1;&#x4EBA;&#x4E3A;&#x80FD;&#x7231;&#x4EBA;&#xFF0C;&#x80FD;&#x6076;&#x4EBA;&#x3002;&#x89C1;&#x8D24;&#x800C;&#x4E0D;&#x80FD;&#x4E3E;&#xFF0C;&#x4E3E;&#x800C;&#x4E0D;&#x80FD;&#x5148;&#xFF0C;&#x547D;&#x4E5F;&#xFF1B;&#x89C1;&#x4E0D;&#x5584;&#x800C;&#x4E0D;&#x80FD;&#x9000;&#xFF0C;&#x9000;&#x800C;&#x4E0D;&#x80FD;&#x8FDC;&#xFF0C;&#x8FC7;&#x4E5F;&#x3002;</p>
<p>&#x597D;&#x4EBA;&#x4E4B;&#x6240;&#x6076;&#xFF0C;&#x6076;&#x4EBA;&#x4E4B;&#x6240;&#x597D;&#xFF0C;&#x662F;&#x8C13;&#x62C2;&#x4EBA;&#x4E4B;&#x6027;&#xFF0C;&#x83D1;&#x5FC5;&#x902E;&#x592B;&#x8EAB;&#x3002;&#x662F;&#x6545;&#x541B;&#x5B50;&#x6709;&#x5927;&#x9053;&#xFF0C;&#x5FC5;&#x5FE0;&#x4FE1;&#x4EE5;&#x5F97;&#x4E4B;&#xFF0C;&#x9A84;&#x6CF0;&#x4EE5;&#x5931;&#x4E4B;&#x3002;</p>
<p>&#x751F;&#x8D22;&#x6709;&#x5927;&#x9053;&#xFF0C;&#x751F;&#x4E4B;&#x8005;&#x4F17;&#xFF0C;&#x98DF;&#x4E4B;&#x8005;&#x5BE1;&#xFF0C;&#x4E3A;&#x4E4B;&#x8005;&#x75BE;&#xFF0C;&#x7528;&#x4E4B;&#x8005;&#x8212;&#xFF0C;&#x5219;&#x8D22;&#x6052;&#x8DB3;&#x77E3;&#x3002;&#x4EC1;&#x8005;&#x4EE5;&#x8D22;&#x53D1;&#x8EAB;&#xFF0C;&#x4E0D;&#x4EC1;&#x8005;&#x4EE5;&#x8EAB;&#x53D1;&#x8D22;&#x3002;&#x672A;&#x6709;&#x4E0A;&#x597D;&#x4EC1;&#x800C;&#x4E0B;&#x4E0D;&#x597D;&#x4E49;&#x8005;&#x4E5F;&#xFF0C;&#x672A;&#x6709;&#x597D;&#x4E49;&#x5176;&#x4E8B;&#x4E0D;&#x7EC8;&#x8005;&#x4E5F;&#xFF0C;&#x672A;&#x6709;&#x5E9C;&#x5E93;&#x8D22;&#x975E;&#x5176;&#x8D22;&#x8005;&#x4E5F;&#x3002;&#x5B5F;&#x732E;&#x5B50;&#x66F0;&#xFF1A;&#x300C;&#x755C;&#x9A6C;&#x4E58;&#xFF0C;&#x4E0D;&#x5BDF;&#x4E8E;&#x9E21;&#x8C5A;&#xFF1B;&#x4F10;&#x51B0;&#x4E4B;&#x5BB6;&#xFF0C;&#x4E0D;&#x755C;&#x725B;&#x7F8A;&#xFF1B;&#x767E;&#x4E58;&#x4E4B;&#x5BB6;&#xFF0C;&#x4E0D;&#x755C;&#x805A;&#x655B;&#x4E4B;&#x81E3;&#x3002;&#x4E0E;&#x5176;&#x6709;&#x805A;&#x655B;&#x4E4B;&#x81E3;&#xFF0C;&#x5B81;&#x6709;&#x76D7;&#x81E3;&#x3002;&#x300D;&#x6B64;&#x8C13;&#x56FD;&#x4E0D;&#x4EE5;&#x5229;&#x4E3A;&#x5229;&#xFF0C;&#x4EE5;&#x4E49;&#x4E3A;&#x5229;&#x4E5F;&#x3002;&#x957F;&#x56FD;&#x5BB6;&#x800C;&#x52A1;&#x8D22;&#x7528;&#x8005;&#xFF0C;&#x5FC5;&#x81EA;&#x5C0F;&#x4EBA;&#x77E3;&#x3002;&#x5F7C;&#x4E3A;&#x5584;&#x4E4B;&#xFF0C;&#x5C0F;&#x4EBA;&#x4E4B;&#x4F7F;&#x4E3A;&#x56FD;&#x5BB6;&#xFF0C;&#x83D1;&#x5BB3;&#x5E76;&#x81F3;&#x3002;&#x867D;&#x6709;&#x5584;&#x8005;&#xFF0C;&#x4EA6;&#x65E0;&#x5982;&#x4E4B;&#x4F55;&#x77E3;&#xFF01;&#x6B64;&#x8C13;&#x56FD;&#x4E0D;&#x4EE5;&#x5229;&#x4E3A;&#x5229;&#xFF0C;&#x4EE5;&#x4E49;&#x4E3A;&#x5229;&#x4E5F;&#x3002;</p>
<p></p></div><div class="share"><span>分享到</span>&nbsp;<span class="soc"><a href="javascript:(function(){EN_CLIP_HOST='http://www.evernote.com';try{var%20x=document.createElement('SCRIPT');x.type='text/javascript';x.src=EN_CLIP_HOST+'/public/bookmarkClipper.js?'+(new%20Date().getTime()/100000);document.getElementsByTagName('head')[0].appendChild(x);}catch(e){location.href=EN_CLIP_HOST+'/clip.action?url='+encodeURIComponent(location.href)+'&amp;title='+encodeURIComponent(document.title);}})();" ref="nofollow" target="_blank" class="fa fa-bookmark"></a></span><span class="soc"><a href="javascript:void((function(s,d,e){try{}catch(e){}var f='http://service.weibo.com/share/share.php?',u=d.location.href,p=['url=',e(u),'&amp;title=',e(d.title),'&amp;appkey=2924220432'].join('');function a(){if(!window.open([f,p].join(''),'mb',['toolbar=0,status=0,resizable=1,width=620,height=450,left=',(s.width-620)/2,',top=',(s.height-450)/2].join('')))u.href=[f,p].join('');};if(/Firefox/.test(navigator.userAgent)){setTimeout(a,0)}else{a()}})(screen,document,encodeURIComponent));" class="fa fa-weibo"></a></span><span class="soc"><a href="http://twitter.com/home?status=https://brokge.github.io/2018/11/01/大学/%20吾與爾%20大学" class="fa fa-twitter"></a></span></div><div class="pagination"><p class="clearfix"><span class="pre pagbuttons"><a role="navigation" href="/2019/01/05/正则/" title="正则"><i class="fa fa-angle-double-left"></i>&nbsp;上一篇: 正则</a></span></p></div><div id="vcomments"></div><script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script><script src="//unpkg.com/valine/dist/Valine.min.js"></script><script type="text/javascript">(function(){
    new Valine({
    el: '#vcomments',
    appId: 'UmwJ3stwyISCG9WnW9Nc3SAN-gzGzoHsz',
    appKey: 'UKq878kYn6RXJWx34b77lma6'})
})();
</script></div></div></div><div class="visible-xs site-bottom-footer"><footer><p>&copy;&nbsp;2019&nbsp;<a target="_blank" href="https://brokge.github.io" rel="noopener noreferrer">brokge</a></p><p>Theme&nbsp;<a target="_blank" href="https://github.com/SumiMakito/hexo-theme-typography" rel="noopener noreferrer">Typography</a>&nbsp;by&nbsp;<a target="_blank" href="https://www.keep.moe" rel="noopener noreferrer">Makito</a></p><p>Proudly published with&nbsp;<a target="_blank" href="https://hexo.io" rel="noopener noreferrer">Hexo</a></p></footer><script type="text/javascript" id="maid-script" src="https://unpkg.com/mermaid@7.1.2/dist/mermaid.min.js?v=undefined"></script><script>if (window.mermaid) {
  var options = JSON.parse(document.getElementById('maid-script').getAttribute('mermaidoptioins'));
  mermaid.initialize(options);
}
 </script></div></div></div></div><script src="/js/jquery-3.1.0.min.js"></script><script src="/js/bootstrap.min.js"></script><script src="/js/jquery-migrate-1.2.1.min.js"></script><script src="/js/jquery.appear.js"></script><script src="/js/google-analytics.js"></script><script src="/js/typography.js"></script></body></html>